//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "არასწორი მომხმარებელი ან პაროლი";
"_cancelled_by_user"                    = "ტრანსფერი უარყოფილია";
"_error_folder_destiny_is_the_same_"    = "It is not possible to move the folder into itself";
"_error_not_permission_"                = "ოპერაციის დასასრულებლად არ გაგაჩნიათ უფლებები";
"_error_path_"                          = "ამ ფაილის ან დირექტორიის გახსნა შეუძლებელია. დარწმუნდით რომ ის არსებობს";
"_file_upload_not_exitst_"              = "The file that you want to upload does not exist";
"_forbidden_characters_from_server_"    = "სახელი მოიცავს დაუშვებელ ნიშანს";
"_not_connected_internet_"              = "სერვერთან კავშირის შეცდომა";
"_not_possible_connect_to_server_"      = "ამ მომენტისთვის სერვერთან დაკავშირება ვერ ხერხდება";
"_not_possible_create_folder_"          = "დირექტორია ვერ იქმნება";
"_server_down_"                         = "Could not establish contact with server";
"_time_out_"                            = "დროის ამოწურვა, სცადეთ ახლიდან";
"_unknow_response_server_"              = "სერვერმა დააბრუნა მოულოდნელი პასუხი";
"_user_autentication_required_"         = "საჭიროა მომხმარებლის აუტენტიფიკაცია";
"_file_directory_locked_"               = "ფაილი ან დირექტორია ჩაკეტილია";
"_ssl_certificate_untrusted_"           = "ამ სერვერის სერტიფიკატი არასწორია";
"_internal_server_"                     = "Internal server error";
"_file_already_exists_"                 = "Could not complete the operation, a file with the same name exists";
"_file_folder_not_exists_"              = "მოცემული მისამართით წყაროს ფაილი ვერ მოიძებნა";
"_folder_contents_nochanged_"           = "დირექტორიის მოცულობა არ შეცვლილა";
"_images_invalid_converted_"            = "სურათი არაა მართებული და ვერ კონვერტირდება მინიატურად";
"_method_not_expected_"                 = "Unexpected request method";
"_reauthenticate_user_"                 = "Access expired, log in again";
"_server_error_retry_"                  = "სერვერი დროებით მიუწვდომელია";
"_too_many_files_"                      = "Too many files would be involved in this operation";
"_too_many_request_"                    = "Sending too many requests caused the rate limit to be reached";
"_user_over_quota_"                     = "მიღწეულია საცავის კვოტის მაქსიმუმი";
"_ssl_connection_error_"                = "SSL კავშირის შეცდომა, სცადეთ ახლიდან";
"_bad_request_"                         = "ცუდი მოთხოვნა";
"_webdav_locked_"                       = "WebDAV Locked: Trying to access locked resource";
"_error_user_not_available_"            = "The user is no longer available";
"_server_response_error_"               = "Server response content error";


